;
(function() {
	var app = angular.module('locdee.controller', []);
	app.controller('headerCtrl', function($scope, $window) {
		$scope.actjud = 'index';
		$scope.arr = $window.location.hash.split('/')
		$scope.actjud = $scope.arr[1];
		$scope.act = function(e) {
			$scope.actjud = e;
//			console.log($scope.actjud)
			$window.location.href = '#/' + e;
		};
		$scope.navs = [
			{
				id:'index',
				name:'首页'
			},
			{
				id:'farm',
				name:'九月农牧'
			},
			{
				id:'nxhz',
				name:'宁乡花猪'
			},
			{
				id:'news',
				name:'新闻中心'
			},
			{
				id:'contactus',
				name:'联系我们'
			},
			{
				id:'joinus',
				name:'加入我们'
			}
		]
	})
	app.controller('indexcontentCtrl', function($scope, $sce) {
		$scope.contophtext = '自然之源·品质之粹·用心之作';
		$scope.contopptext = '湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山庄有限公司、宁乡湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山庄有限公司、宁乡湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山庄有限公司、宁乡湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山庄有限公司、宁乡。';
		$scope.condls = [{
			url: 'images/indexcontent/c1.jpg',
			htext: '新型的多元化现代农牧企业',
			ptext: $sce.trustAsHtml('九月牧农遵循时代发展、开拓创新，依托日趋发展的互联网构建庞大的产品运营平台，同时致力于互联网平台和手九月牧农遵循时代发展、开拓创新，依托日趋发展的互联网构建庞大的产品运营平台。')
		}, {
			url: 'images/indexcontent/c4.jpg',
			htext: '特色环保生态饲养基地',
			ptext: $sce.trustAsHtml('宁乡隶属湖南省会长沙市，属长沙市西郊区，拥有独到的地域优势，是国家两型社会综合配套改革试验区长沙大河西先<br/> 宁乡隶属湖南省会长沙市，属长沙市西郊区，拥有独到的地域优势。')
		}, {
			url: 'images/indexcontent/c5.jpg',
			htext: '与时俱进的产品模式',
			ptext: $sce.trustAsHtml('营养健康的全生态种植、养殖作物。<br/>在高端能订制生活方式的理念下制定产品组合。<br/> 展开绿色生鲜BIS建设，是产品展开绿色生鲜BIS建设，是产品。')
		}]
	})
	app.controller('farmCtrl', function($scope) {
		$scope.chconts = [{
			url: 'images/farm/f_1.jpg',
			conttext: '湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山 湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山 湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山 湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山 湖南九月农牧是新型的多元化现代农牧企业，关联企业有：九月畜牧科技有限公司、宁乡九月肉制品有限公司、宁乡县五养山',
			isleft: true
		}, {
			url: 'images/farm/f_2.jpg',
			conttext: '目前九月农牧倾力打造的“九月新农园”其品牌以中国四大名猪“宁乡花猪”为拳头产品。秉承原生态生产流程，同时导入智目前九月农牧倾力打造的“九月新农园”其品牌以中国四大名猪“宁乡花猪”为拳头产品。秉承原生态生产流程，同时导入智目前九月农牧倾力打造的“九月新农园”其品牌以中国四大名猪“宁乡花猪”为拳头产品。秉承原生态生产流程，同时导入智目前九月农牧倾力打造的“九月新农园”其品牌以中国四大名猪“宁乡花猪”为拳头产品。秉承原生态生产流程，同时导入智',
			isleft: false
		}, {
			url: 'images/farm/f_3.jpg',
			conttext: '九月农牧以传承“生态、健康、绿色”的传统为理念，本着“科学、专业”的态度，以现代科技，科学、系统的为高端用户群 九月农牧以传承“生态、健康、绿色”的传统为理念，本着“科学、专业”的态度，以现代科技，科学、系统的为高端用户群 九月农牧以传承“生态、健康、绿色”的传统为理念，本着“科学、专业”的态度，以现代科技，科学、系统的为高端用户群 九月农牧以传承“生态、健康、绿色”的传统为理念，本着“科学、专业”的态度，以现代科技，科学、系统的为高端用户群 九月农牧以传承“生态、健康、绿色”的传统为理念，本着“科学、专业”的态度，以现代科技，科学、系统的为高端用户群',
			isleft: true,
			islast: true
		}]
	})
	app.controller('nxhzCtrl', function($scope) {
		$scope.loadShow = false;
		$scope.hzlists = [{
				url: 'images/farm/huazhu1.jpg',
				hspan: '>【花猪养殖】',
				htext: '  论宁乡花猪之“土”，土之深植土壤吸取营养',
				rspan: '2016-08-20',
				ptext: ' 如果宁乡花猪（又称宁乡土猪）都不算土，“洋八戒”表示不服，中国700不一样的湘味印象——红红火火之小炒腊味拼盘！ 湘菜很爱用大量的青红椒炒、腊肉、腊猪脸之类的菜品，红红火火一大盘'
			}, {
				url: 'images/farm/huazhu2.jpg',
				hspan: '>【花猪烹饪】',
				htext: ' 不一样的湘味印象——红红火火之小炒腊味拼盘！',
				rspan: '2016-08-20',
				ptext: ' 湘菜很爱用大量的青红椒炒、腊肉、腊猪脸之类的菜品，红红火火一大盘如果宁乡花猪（又称宁乡土猪）都不算土，“洋八戒”表示不服，中国700不一样的湘味印象——红红火火之小炒腊味拼盘！ 湘菜很爱用大量的青红椒炒、腊肉、腊猪脸之类的菜品，红红火火一大盘'
			}, {
				url: 'images/farm/huazhu1.jpg',
				hspan: '>【花猪养殖】',
				htext: '  论宁乡花猪之“土”，土之深植土壤吸取营养',
				rspan: '2016-08-20',
				ptext: ' 如果宁乡花猪（又称宁乡土猪）都不算土，“洋八戒”表示不服，中国700不一样的湘味印象——红红火火之小炒腊味拼盘！ 湘菜很爱用大量的青红椒炒、腊肉、腊猪脸之类的菜品，红红火火一大盘'
			}, {
				url: 'images/farm/huazhu1.jpg',
				hspan: '>【花猪养殖】',
				htext: '  论宁乡花猪之“土”，土之深植土壤吸取营养',
				rspan: '2016-08-20',
				ptext: ' 如果宁乡花猪（又称宁乡土猪）都不算土，“洋八戒”表示不服，中国700不一样的湘味印象——红红火火之小炒腊味拼盘！ 湘菜很爱用大量的青红椒炒、腊肉、腊猪脸之类的菜品，红红火火一大盘'
			}, {
				url: 'images/farm/huazhu1.jpg',
				hspan: '>【花猪养殖】',
				htext: '  论宁乡花猪之“土”，土之深植土壤吸取营养',
				rspan: '2016-08-20',
				ptext: ' 如果宁乡花猪（又称宁乡土猪）都不算土，“洋八戒”表示不服，中国700不一样的湘味印象——红红火火之小炒腊味拼盘！ 湘菜很爱用大量的青红椒炒、腊肉、腊猪脸之类的菜品，红红火火一大盘'
			}, {
				url: 'images/farm/huazhu1.jpg',
				hspan: '>【花猪养殖】',
				htext: '  论宁乡花猪之“土”，土之深植土壤吸取营养',
				rspan: '2016-08-20',
				ptext: ' 如果宁乡花猪（又称宁乡土猪）都不算土，“洋八戒”表示不服，中国700不一样的湘味印象——红红火火之小炒腊味拼盘！ 湘菜很爱用大量的青红椒炒、腊肉、腊猪脸之类的菜品，红红火火一大盘'
			}

		]
	})
	app.controller('newsCtrl', function($scope) {
		$scope.showId = '1';
		$scope.loadShow = false;
		$scope.newsShow = function(id) {
			$scope.showId = id;
		};
		//		$scope.load = function() {
		//			$scope.loadShow = false;
		//		};

		$scope.news = [{
			id: 1,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, {
			id: 2,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, {
			id: 3,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, {
			id: 4,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, {
			id: 5,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, {
			id: 6,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, {
			id: 7,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, {
			id: 8,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, {
			id: 9,
			img: 'images/farm/news.jpg',
			title: '只要站在风口上 花猪也能飞上天',
			detaildate: '2016-8-20 13:00',
			detailtext: '只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天<br/> 只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天只要站在风口上 花猪也能飞上天',
			hspan: '> 【行业新闻】 ',
			date: '2016-8-20'
		}, ]
	})

	app.controller('joinusCtrl', function($scope, $sce) {
		$scope.showId = 1;
		$scope.jobShow = function(id) {
			if($scope.showId == id) {
				$scope.showId = 0;
			} else {
				$scope.showId = id;
			};

		};
		$scope.jobs = [{
				id: 1,
				name: 'Java开发工程师',
				place: '广州',
				num: 2,
				date: '2016-8-20',
				html: $sce.trustAsHtml('<p><span>工作职责：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养<br />' +
					'<span>职位要求：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /></p>')
			}, {
				id: 2,
				name: '市场运营部经理',
				place: '广州',
				num: 1,
				date: '2016-8-20',
				html: $sce.trustAsHtml('<p><span>工作职责：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养<br />' +
					'<span>职位要求：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /></p>')
			}, {
				id: 3,
				name: '市场部运营专员实习生',
				place: '广州',
				num: 4,
				date: '2016-8-20',
				html: $sce.trustAsHtml('<p><span>工作职责：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养<br />' +
					'<span>职位要求：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /></p>')
			}, {
				id: 4,
				name: '人事专员',
				place: '广州',
				num: 2,
				date: '2016-8-20',
				html: $sce.trustAsHtml('<p><span>工作职责：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养<br />' +
					'<span>职位要求：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /></p>')
			}, {
				id: 5,
				name: '商务拓展支持专员',
				place: '广州',
				num: 2,
				date: '2016-8-20',
				html: $sce.trustAsHtml('<p><span>工作职责：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养<br />' +
					'<span>职位要求：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /></p>')
			}, {
				id: 6,
				name: '用户市场活动经理',
				place: '广州',
				num: 2,
				date: '2016-8-20',
				html: $sce.trustAsHtml('<p><span>工作职责：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养<br />' +
					'<span>职位要求：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /></p>')
			}, {
				id: 7,
				name: '高级商务经理(政府方向)',
				place: '广州',
				num: 2,
				date: '2016-8-20',
				html: $sce.trustAsHtml('<p><span>工作职责：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养<br />' +
					'<span>职位要求：</span><br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /> -带领团队进行技术和架构探索,实现团队的技术培养负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责糯米营销及导流产品、新服务的软件架构设计及研发' +
					'<br /> -负责算法改进、架构优化及策略研发 <br /></p>')
			}

		]
	})
	app.controller('contactusCtrl', function() {

	})

	app.controller('sidemanu', function($scope, $window) {
		$scope.totop = function() {
			var speed = document.body.scrollTop/50;
			var timer = setInterval(function(){
				document.body.scrollTop -= speed ;
				if(document.body.scrollTop <= 0){
					clearInterval(timer);
				};
			},10)
		};
		$scope.wbool = false;
		$scope.pbool = false;

	})

})();